app/controllers/earthquakes_controller.rb

 	def show
 		@earthquake = Earthquake.find(params[:id])
---
SELECT  "earthquakes".* FROM "earthquakes" WHERE "earthquakes"."id" = ? LIMIT 1  [["id", 2]]